RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/MCUX_Config/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8C
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,
      0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,
      0U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,
      0x02U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,
      0x02U);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_32_LPUART10_TX,
      0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_33_LPUART10_RX,
      0U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_32_LPUART10_TX,
      0x02U);
      IOMUXC_GPIO_AD_33_LPUART10_RX,
      0x02U);

      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AON_19_LPUART12_TX,
          0U);
      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AON_20_LPUART12_RX,
          0U);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AON_19_LPUART12_TX,
          0x02U);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AON_20_LPUART12_RX,
          0x02U);

      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AON_16_LPI2C2_SCL,
          1U);
      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AON_15_LPI2C2_SDA,
          1U);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AON_16_LPI2C2_SCL,
          0x1DU);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AON_15_LPI2C2_SDA,
          0x1DU);

      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AD_18_LPI2C3_SCL,
          0U);
      IOMUXC_SetPinMux(
          IOMUXC_GPIO_AD_19_LPI2C3_SDA,
          0U);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AD_18_LPI2C3_SCL,
          0x1DU);
      IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AD_19_LPI2C3_SDA,
          0x1DU);
}

void BOARD_InitLeds(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration on GPIO_AD_27 (pin M16) */
  rgpio_pin_config_t gpio4_pinM16_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 1U,
  };
  /* Initialize GPIO functionality on GPIO_AD_27 (pin M16) */
  RGPIO_PinInit(RGPIO4, 27U, &gpio4_pinM16_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_GPIO4_IO27,           /* GPIO_AD_27 is configured as GPIO4_IO27 */
      0U);
}


/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
